config/transient.org
#+auto_tangle: y

* Install Transient and Transient Showcase

#+begin_src emacs-lisp :tangle yes
  ;; Debug: Check state before loading transient
  (message "=== TRANSIENT DEBUG ===")
  (message "Before: transient loaded? %s" (featurep 'transient))
  (when (featurep 'transient)
    (message "Before: transient-version = %s"
             (if (boundp 'transient--version) transient--version "undefined")))

  (use-package transient
    :straight t  ; Use latest version instead of old v0.6.0
    :demand t    ; Force immediate load to override built-in version
    :config
    (message "After: transient loaded from %s"
             (locate-library "transient"))
    (message "After: transient-version = %s"
             (if (boundp 'transient--version) transient--version "undefined"))
    (message "After: has transient--set-layout? %s"
             (fboundp 'transient--set-layout))
    (message "=== END TRANSIENT DEBUG ==="))
#+end_src


Transient Showcase comes with a [[file:~/.emacs.d/straight/repos/transient-showcase/transient-showcase.org][literate org]] file for exploring

#+begin_src emacs-lisp :tangle yes
  (use-package transient-showcase
    :straight '(transient-showcase :type git :host github :repo "positron-solutions/transient-showcase"))
#+end_src

* Other Docs

[[id:C0A680FA-A7F2-4FB0-A6D6-7F7DFC7B2155][emacs transient]]
